---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectContext3D.IndexStreamLine
source: html/772e4d4f-98ae-fa3e-06b4-bde133967d12.htm
---
# IndexStreamLine Properties

Specifies whether the .NET object represents a valid Revit entity.